name: "video-handler"
max_batch_size: 0
backend: "python"

input [
	{
		name: "video_url"
		data_type: TYPE_STRING
		dims: [ -1 ]
	}
]

output {
    name: "OUTPUT"
    data_type: TYPE_STRING
    dims: [ -1 ]
}

instance_group [{ kind: KIND_CPU }]

